---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures.UnableToGenerateCurve
source: html/1bb7eedc-85f9-26ee-492f-22d0a266d0fe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures.UnableToGenerateCurve Property

Unable to generate valid curve geometry from the driving points. The line by points will be dissolved.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToGenerateCurve { get; }
```